app/Helpers/helpers.php

    function contacts() {
        return Contact::where('status', 'new')->get();
---
select * from `contacts` where `status` = 'new'

    function getTotalRecords(string $module) {
        switch (strtolower($module)) {
            case 'blog':
                return Blog::count();

            case 'page':
                return Page::count();

            case 'contact':
                return Contact::count();

            case 'category':
                return Category::count();
---
select count(*) as aggregate from `blogs`
select count(*) as aggregate from `pages`
select count(*) as aggregate from `contacts`
select count(*) as aggregate from `categories`