Modules/Lang/app/Http/Controllers/LangController.php

select count(*) as aggregate from `langs`
---
    public function index($group = null)
    {
        $languages = Lang::latest()->paginate(1);