app/Http/Controllers/Dashboard/DashboardController.php

    public function dashboard()
    {
        $blogs = Blog::where('status', 'published')
                            ->whereNotNull('published_at')
                            ->orderBy('published_at', 'desc')
                            ->inRandomOrder()
                            ->limit(10)
                            ->paginate(5);
---
select * from `blogs` where `status` = 'published' and `published_at` is not null order by `published_at` desc, RAND() limit 5 offset 0
select count(*) as aggregate from `blogs` where `status` = 'published' and `published_at` is not null